benchmark-results/round-3-intel-full-atillery/redis.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      1560575.19          ---          ---         0.98176         0.98300         1.09500         1.16700         1.42300         1.83100         2.19100         2.28700         2.67100         3.51900    103462.80 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1560575.19         0.00         0.00         0.98176         0.98300         1.09500         1.16700         1.42300         1.83100         2.19100         2.28700         2.67100         3.51900    103462.80 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       143074.30          ---          ---         0.97249         0.96700         1.09500         1.18300         1.47900         1.85500         2.17500         2.31900         3.45500         3.66300      9500.15 
Gets      1430727.26      7833.40   1422893.86         0.97246         0.96700         1.09500         1.18300         1.47900         1.85500         2.17500         2.31900         3.42300         3.67900     57443.08 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1573801.56      7833.40   1422893.86         0.97246         0.96700         1.09500         1.18300         1.47900         1.85500         2.17500         2.31900         3.43900         3.67900     66943.23 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        29035.14          ---          ---         0.60359         0.59100         0.72700         0.80700         1.07100         1.33500         1.50300         1.55900         1.80700         2.11100      1927.91 
Gets       290313.07      1711.71    288601.36         0.60376         0.59100         0.72700         0.80700         1.07100         1.32700         1.50300         1.56700         1.71100         2.20700     11658.48 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     319348.21      1711.71    288601.36         0.60375         0.59100         0.72700         0.80700         1.07100         1.32700         1.50300         1.56700         1.71900         2.20700     13586.39 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       144216.09          ---          ---         0.96628         0.96700         1.09500         1.15900         1.36700         1.60700         1.94300         2.04700         2.43100         2.95900      9561.24 
Gets      1442144.99   1442144.99         0.00         0.96631         0.96700         1.09500         1.15900         1.36700         1.60700         1.95100         2.04700         2.43100         2.95900     88569.38 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1586361.08   1442144.99         0.00         0.96631         0.96700         1.09500         1.15900         1.36700         1.60700         1.95100         2.04700         2.43100         2.95900     98130.62 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        29009.43          ---          ---         0.60052         0.58300         0.71900         0.80700         1.07100         1.31100         1.46300         1.51100         1.91100         3.15100      1923.18 
Gets       290056.01    290056.01         0.00         0.60073         0.58300         0.71900         0.80700         1.07100         1.31100         1.46300         1.51100         1.79900         2.52700     17813.67 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     319065.44    290056.01         0.00         0.60071         0.58300         0.71900         0.80700         1.07100         1.31100         1.46300         1.51100         1.81500         3.15100     19736.86